Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
    co_ota_cb_t ota; // ota control block

} co_cb_t;

static co_cb_t *global_cb = NULL;

typedef void (*co_process_fn_t)(void *);

typedef struct co_process_entry {
    const char *str;
    co_process_fn_t fn;
} co_process_entry_t;

static void co_ota_start(void *data);
static void co_ota_stop(void *data);

#define CO_ENTRY_DICT_LEN      (sizeof(co_entry_dict) / sizeof(co_entry_dict[0]))
#define CO_ENTRT_DICT_ITEM_LEN (sizeof(co_entry_dict[0]))

// must be sorted alphabetically
static const co_process_entry_t co_entry_dict[] = {
    {"start", co_ota_start},
    {"stop", co_ota_stop},
};

static int co_compare(const void *s1, const void *s2) {
    const co_process_entry_t *e1 = s1;
    const co_process_entry_t *e2 = s2;

    return strcmp(e1->str, e2->str);
}

static co_process_fn_t co_get_process_entry(char *str) {
    co_process_entry_t *res;
    co_process_entry_t key = {str, NULL};

    res = bsearch(&key, co_entry_dict, CO_ENTRY_DICT_LEN, CO_ENTRT_DICT_ITEM_LEN, co_compare);
    if (res) {
        return res->fn;
    }

    return NULL;
}

#if (CO_TARGET_ESP8266)
extern void uart_tx_wait_idle(uint8_t uart_no);
extern void esp_reset_reason_set_hint(esp_reset_reason_t hint);

/**
 * @brief In some cases, reboot operation cannot be completed properly, so we take a forced reboot.
 *
 */
static void CO_NO_RETURN co_hardware_restart() {

    vPortEnterCritical(); // avoid entering the panicHandler

    uart_tx_wait_idle(0);
    uart_tx_wait_idle(1);

    esp_reset_reason_set_hint(ESP_RST_SW); // software restart

    // force restart
    CLEAR_WDT_REG_MASK(WDT_CTL_ADDRESS, BIT0);
    WDT_REG_WRITE(WDT_OP_ADDRESS, 1);
    WDT_REG_WRITE(WDT_OP_ND_ADDRESS, 1);
    SET_PERI_REG_BITS(PERIPHS_WDT_BASEADDR + WDT_CTL_ADDRESS,
                      WDT_CTL_RSTLEN_MASK,
                      7 << WDT_CTL_RSTLEN_LSB,
                      0);
    SET_PERI_REG_BITS(PERIPHS_WDT_BASEADDR + WDT_CTL_ADDRESS,
                      WDT_CTL_RSPMOD_MASK,
                      0 << WDT_CTL_RSPMOD_LSB,
                      0);
    SET_PERI_REG_BITS(PERIPHS_WDT_BASEADDR + WDT_CTL_ADDRESS,
                      WDT_CTL_EN_MASK,
                      1 << WDT_CTL_EN_LSB,
                      0);

    while (1) {
    }
}
#endif // CO_TARGET_ESP8266

#if (CO_TARGET_ESP32)
extern void uart_tx_wait_idle(uint8_t uart_no);
extern void esp_reset_reason_set_hint(esp_reset_reason_t hint);
extern void xt_ints_off(unsigned int mask);

/**
 * @brief In some cases, reboot operation cannot be completed properly, so we take a forced reboot.
 *
 */
void CO_NO_RETURN co_hardware_restart() {
    wdt_hal_context_t rtc_wdt_ctx;
    uint32_t stage_timeout_ticks;

    xt_ints_off(0xFFFFFFFF); // disable all interrupts

    uart_tx_wait_idle(0);
    uart_tx_wait_idle(1);
    uart_tx_wait_idle(2);

    wdt_hal_init(&rtc_wdt_ctx, WDT_RWDT, 0, false);
    stage_timeout_ticks = (uint32_t)(1000ULL * rtc_clk_slow_freq_get_hz() / 1000ULL);
    wdt_hal_write_protect_disable(&rtc_wdt_ctx);
    wdt_hal_config_stage(&rtc_wdt_ctx, WDT_STAGE0, stage_timeout_ticks, WDT_STAGE_ACTION_RESET_SYSTEM);
    wdt_hal_config_stage(&rtc_wdt_ctx, WDT_STAGE1, stage_timeout_ticks, WDT_STAGE_ACTION_RESET_RTC);
    wdt_hal_set_flashboot_en(&rtc_wdt_ctx, true);
    wdt_hal_write_protect_enable(&rtc_wdt_ctx);

    esp_reset_reason_set_hint(ESP_RST_SW); // software restart

    while (1) {
    }
}
#elif (CO_TARGET_ESP32S3)
extern void uart_tx_wait_idle(uint8_t uart_no);
extern void esp_reset_reason_set_hint(esp_reset_reason_t hint);
extern void xt_ints_off(unsigned int mask);

void CO_NO_RETURN co_hardware_restart() {
    wdt_hal_context_t rtc_wdt_ctx;
    uint32_t stage_timeout_ticks;

    xt_ints_off(0xFFFFFFFF); // disable all interrupts

    uart_tx_wait_idle(0);
    uart_tx_wait_idle(1);
    uart_tx_wait_idle(2);

    wdt_hal_init(&rtc_wdt_ctx, WDT_RWDT, 0, false);
    stage_timeout_ticks = (uint32_t)(1000ULL * rtc_clk_slow_freq_get_hz() / 1000ULL);
    wdt_hal_write_protect_disable(&rtc_wdt_ctx);
    wdt_hal_config_stage(&rtc_wdt_ctx, WDT_STAGE0, stage_timeout_ticks, WDT_STAGE_ACTION_RESET_SYSTEM);
    wdt_hal_config_stage(&rtc_wdt_ctx, WDT_STAGE1, stage_timeout_ticks, WDT_STAGE_ACTION_RESET_RTC);
    wdt_hal_set_flashboot_en(&rtc_wdt_ctx, true);
    wdt_hal_write_protect_enable(&rtc_wdt_ctx);

    esp_reset_reason_set_hint(ESP_RST_SW); // software restart

    while (1) {
    }
}
#elif (CO_TARGET_ESP32C3)
extern void uart_tx_wait_idle(uint8_t uart_no);
extern void esp_reset_reason_set_hint(esp_reset_reason_t hint);
extern void riscv_global_interrupts_disable(void);
/**
 * @brief In some cases, reboot operation cannot be completed properly, so we take a forced reboot.
 *
 */
void CO_NO_RETURN co_hardware_restart() {
    wdt_hal_context_t rtc_wdt_ctx;
    uint32_t stage_timeout_ticks;

    riscv_global_interrupts_disable(); // disable all interrupts

    uart_tx_wait_idle(0);
    uart_tx_wait_idle(1);

    wdt_hal_init(&rtc_wdt_ctx, WDT_RWDT, 0, false);
    stage_timeout_ticks = (uint32_t)(1000ULL * rtc_clk_slow_freq_get_hz() / 1000ULL);
    wdt_hal_write_protect_disable(&rtc_wdt_ctx);
    wdt_hal_config_stage(&rtc_wdt_ctx, WDT_STAGE0, stage_timeout_ticks, WDT_STAGE_ACTION_RESET_SYSTEM);
    wdt_hal_config_stage(&rtc_wdt_ctx, WDT_STAGE1, stage_timeout_ticks, WDT_STAGE_ACTION_RESET_RTC);
    wdt_hal_set_flashboot_en(&rtc_wdt_ctx, true);
    wdt_hal_write_protect_enable(&rtc_wdt_ctx);

    esp_reset_reason_set_hint(ESP_RST_SW); // software restart

    while (1) {
    }
}

#endif // CO_TARGET_ESP32

/**
 * @brief Parse the request text and populate the op and data.
 *
 * @param text Original request text
 * @param[in] op operation field
 * @param[in] data data field
 * @return co_err_t
 * - CO_OK
 * - CO_FAIL
 */

//原先的
// static co_err_t co_parse_request_text(const char *text, char *op, char *data) {
//     int ret, n;

//     n = 0;
//     // "op=auth&data=password"
//     // "op=start&data=12345"
//     // "op=stop&data="
//     ret = sscanf(text, "op=%10[^&]&data=%n%10s", op, &n, data);
//     if (ret == 2) {
//         return CO_OK;
//     } else if (ret == 1 && text[n] == '\0') { // data is empty
//         data[0] = '\0';
//         return CO_OK;
//     } else {
//         return CO_FAIL;
//     }
// }
static co_err_t co_parse_request_text(const char *text, char *op, char *data, char *target, char *options) {
    int ret, n, target_pos = 0, options_pos = 0;
    
