Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
    snprintf(res_header, sizeof(res_header),
             "HTTP/1.1 101 Switching Protocols\r\n"
             "Server: corsacOTA server\r\n"
             "Upgrade: websocket\r\n"
             "Connection: Upgrade\r\n"
             "Sec-WebSocket-Accept: %s\r\n"
             "\r\n",
             accept_key);

    res_header_length = strlen(res_header);
    send(fd, res_header, res_header_length, 0);

    return ESP_OK;
}

static esp_err_t co_websocket_handshake_process(co_cb_t *cb, co_socket_cb_t *scb) {
    if (scb->remaining_len == 0) {
        memset(scb->buf, 0, CONFIG_CO_SOCKET_BUFFER_SIZE);
    }

    int offset = scb->remaining_len;
    int fd = scb->fd;

    int ret = recv(fd, scb->buf + offset, CONFIG_CO_SOCKET_BUFFER_SIZE - offset, 0);
    if (ret <= 0) {
        co_http_error_400_response(cb, scb);
        return ESP_FAIL;
    }

    scb->remaining_len += ret;

    // Already received the entire http header?
    if (scb->remaining_len < 4 || memcmp(scb->buf + scb->remaining_len - 4, "\r\n\r\n", 4) != 0) {
        return ESP_OK; // Not yet received
    }

    const char *header_start = scb->buf, *header_end = scb->buf + scb->remaining_len - 1;
    const char *ws_key_start, *ws_key_end;

    if (co_http_header_find_field_value(header_start, header_end, "Upgrade", "websocket") == NULL ||
        co_http_header_find_field_value(header_start, header_end, "Connection", "Upgrade") == NULL ||
        (ws_key_start = co_http_header_find_field_value(header_start, header_end, "Sec-WebSocket-Key", NULL)) == NULL) {
        co_http_error_400_response(cb, scb);
        return ESP_FAIL;
    }

    /* example:
     Sec-WebSocket-Key: c2REMVVpRXJRQWJ0Q1dKeQ==\r\n
                       |
                    ws_key_start
    */

    // skip the extra blank
    for (; *ws_key_start == ' '; ws_key_start++) {
        ;
    }

    // find the end of ws key
    for (ws_key_end = ws_key_start; *ws_key_end != '\r' && *ws_key_end != ' '; ws_key_end++) {
        ;
    }

    /* example:
     Sec-WebSocket-Key: c2REMVVpRXJRQWJ0Q1dKeQ==\r\n
                        |                       ||
                    ws_key_start            ws_key_end
    */
    if (ws_key_end - ws_key_start != 24) {
        co_http_error_400_response(cb, scb);
        return ESP_FAIL;
    }

    if (co_websocket_handshake_send_key(scb->fd, ws_key_start) != ESP_OK) {
        co_http_error_400_response(cb, scb);
        return ESP_FAIL;
    }

    ESP_LOGD(CO_TAG, "websocket handshake success");

    cb->websocket = scb;
    scb->status = CO_SOCKET_WEBSOCKET_HEADER;
    scb->remaining_len = 0;

    memset(scb->buf, 0, CONFIG_CO_SOCKET_BUFFER_SIZE);

    return ESP_OK;
}

static esp_err_t co_socket_data_process(co_cb_t *cb, co_socket_cb_t *scb) {
    if (cb == NULL || scb == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    switch (scb->status) {
    case CO_SOCKET_ACCEPT:
        ESP_LOGW(CO_TAG, LOG_FMT("This state should not occur"));
        return ESP_FAIL; //// TODO: remove this?
    case CO_SOCKET_HANDSHAKE:
        return co_websocket_handshake_process(cb, scb);
    case CO_SOCKET_WEBSOCKET_HEADER:
    case CO_SOCKET_WEBSOCKET_EXTEND_LENGTH:
    case CO_SOCKET_WEBSOCKET_MASK:
    case CO_SOCKET_WEBSOCKET_PAYLOAD:
        return co_websocket_process(cb, scb);
    default:
        ESP_LOGW(CO_TAG, LOG_FMT("This state should not occur"));
        return ESP_OK;
    }
}

static esp_err_t co_socket_list_alloc(co_cb_t *cb) {
    if (cb == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    int i;
    cb->socket_list = calloc(cb->max_listen_num, sizeof(co_socket_cb_t *)); // pointer list
    if (cb->socket_list == NULL) {
        return ESP_ERR_NO_MEM;
    }

    for (i = 0; i < cb->max_listen_num; i++) {
        if ((cb->socket_list[i] = calloc(1, sizeof(struct co_socket_cb))) == NULL) {
            goto fail;
        }
    }
    return ESP_OK;

fail:
    for (i = 0; i < cb->max_listen_num; i++) {
        if (cb->socket_list[i] != NULL) {
            free(cb->socket_list[i]);
        }
    }
    free(cb->socket_list);
    cb->socket_list = NULL;
    return ESP_ERR_NO_MEM;
}

/**
 * @brief add a new fd to socket list
 *
 * @param cb corsacOTA control block
 * @param fd socket file descriptor
 * @return err_t
 */
static err_t co_socket_list_insert(co_cb_t *cb, int fd) {
    int i;
    for (i = 0; i < cb->max_listen_num; i++) {
        if (cb->socket_list[i]->fd == -1) {
            cb->socket_list[i]->fd = fd;
            return ESP_OK;
        }
    }

    return ESP_FAIL;
}

/**
 * @brief Iterate to get each socket control blck in socket list
 *
 * @param cb corsacOTA control block
 * @param begin The fd obtained in the previous iteration. Should be `NULL` for the initial iteration.
 * @param ignore_closing If true, all fd's that are closing will be ignored.
 * @return int The current socket control block obtained by the iterator, or `NULL` for not found.
 */
static co_socket_cb_t *co_socket_list_iterate(co_cb_t *cb, co_socket_cb_t *begin, bool ignore_closing) {
    int start_index = 0;
    int i;

    if (begin != NULL) {
        for (i = 0; i < cb->max_listen_num; i++) {
            if (cb->socket_list[i] == begin) {
                start_index = i + 1;
                break;
            }
        }
    }

    for (i = start_index; i < cb->max_listen_num; i++) {
        if (cb->socket_list[i]->fd != -1) {
            if (ignore_closing && cb->socket_list[i]->status == CO_SOCKET_CLOSING) {
                continue;
            }
            return cb->socket_list[i];
        }
    }

    return NULL;
}

/**
 * @brief Invalidate all sockets in the list in the accept stage
 *
 * @param cb corsacOTA cotrol block pointer
 */
static void co_socket_list_init(co_cb_t *cb) {
    int i;
    for (i = 0; i < cb->max_listen_num; i++) {
        cb->socket_list[i]->fd = -1;
        cb->socket_list[i]->status = CO_SOCKET_ACCEPT;
    }
}

static co_cb_t *co_control_block_create(co_config_t *config) {
    co_cb_t *cb = calloc(1, sizeof(co_cb_t));
    if (cb == NULL) {
        return NULL;
    }

    cb->recv_data = malloc(CONFIG_CO_WS_TEXT_BUFFER_SIZE + 1);
    if (cb->recv_data == NULL) {
        free(cb);
        return NULL;
    }

    // setting
    cb->max_listen_num = config->max_listen_num;
    cb->wait_timeout_sec = config->wait_timeout_sec;
    cb->wait_timeout_usec = config->wait_timeout_usec;

